app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    #@comment = Comment.new
    #@comment.username = current_user.username
    #@comment.save
    #@post_comments.create.username = current_user.username
    @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "nice!"], ["post_id", 7], ["created_at", "2017-09-04 08:07:50.047542"], ["updated_at", "2017-09-04 08:07:50.047542"]]