app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE (id = @params[:e_id]) ORDER BY "events"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def show
   @event = Event.where("id = ?", params[:e_id]).first