app/controllers/posts_controller.rb

SELECT "events".* FROM "events"
---
  def index
    @posts = Post.all.order(updated_at: 'desc')
    #イベントデータの格納
    @events = Event.all

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "title 5"], ["body", "body 5"], ["created_at", "2017-09-04 06:57:49.782058"], ["updated_at", "2017-09-04 06:57:49.782058"]]
---
  def create
    #render plain: params[:post].inspect
    #@post = Post.new(params.require(:post).permit(:title, :body))
    @post = Post.new(post_params)
    @post.username = current_user.username
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 8]]
---
  def destroy
    @post = Post.find(params[:id])
    if @post.username != current_user.username then
    else
      @post.destroy